Revit 2024 API
BuiltInFailures.GroupFailures.MembersMovedToProjectToMakeConsistent Property
 Group members had to be "moved to the project" (removed from their group instance) because they were not consistent with the group type definition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MembersMovedToProjectToMakeConsistent { get; }
Visual Basic
Public Shared ReadOnly Property MembersMovedToProjectToMakeConsistent As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MembersMovedToProjectToMakeConsistent {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace